[{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/2-cheap-canadian-stocks-best-205400838.html","description":"If you're looking to invest your money today these two Canadian stocks are easily some of the best and cheapest businesses to buy in 2022. The post These 2 Cheap Canadian Stocks Are the Best to Buy Right Now appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - These 2 Cheap Canadian Stocks Are the Best to Buy Right Now"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/m/3ada70e5-81fc-3215-b43b-be731695d0bb/why-aurora-cannabis-stock-is.html","description":"Shares of leading marijuana stock Aurora Cannabis (NASDAQ: ACB) jumped in afternoon trading Friday, after the company beat analyst targets for fiscal second-quarter 2022 revenue and predicted it will achieve \"adjusted EBITDA profitability\" in the first half of next year.  Aurora's good news is even lifting the shares of its fellow travelers in cannabis, Tilray (NASDAQ: TLRY) and Canopy Growth (NASDAQ: CGC).  As of 12:05 p.m. ET, Aurora Cannabis shares are up 3.5% -- but Tilray is up a respectable 2.9%, too, and Canopy Growth is actually surging most of all, up 7%!","country":"CAD","title":"Motley Fool - Why Aurora Cannabis Stock Is Popping Today"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/rate-hike-fallout-big-6-195400081.html","description":"The TSX’s dividend pioneer will not disappoint income investors even if economic growth slows down as an offshoot of higher interest rates. The post Rate-Hike Fallout? A Big 6 Bank Stock to Own Today appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - Rate-Hike Fallout? A Big 6 Bank Stock to Own Today"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/2-top-dividend-aristocrats-buy-184500375.html","description":"Looking for dividend stocks to add to your portfolio? Investors should buy and hold these Dividend Aristocrats forever! The post 2 Top Dividend Aristocrats to Buy and Hold Forever appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 2 Top Dividend Aristocrats to Buy and Hold Forever"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/most-actively-traded-companies-toronto-222530625.html","description":"TORONTO — Some of the most active companies traded Friday on the Toronto Stock Exchange: Toronto Stock Exchange (21,548.84, up 17.12 points.) Manulife Financial Corp. (TSX:MFC). Financials. Down 48 cents, or 1.72 per cent, to $27.41 on 24 million shares. Enbridge Inc. (TSX:ENB). Energy. Up $1.01 or 1.85 per cent, to $55.56 on 14.42 million shares. Suncor Energy Inc. (TSX:SU). Energy. Up $1.67, or 4.55 per cent, to $38.38 on 13.32 million shares. Bombardier Inc. (TSX:BBD.B). Industrials. Down 0.0","country":"CAD","title":" - Most actively traded companies on the Toronto Stock Exchange"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/rrsp-deadline-looms-started-top-171500593.html","description":"RRSP planning made easy: stocks like Fortis, BCE, and Enbridge are top dividend stocks to help in your retirement planning. The post The RRSP Deadline Looms: Get Started With These Top Dividend Stocks appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - The RRSP Deadline Looms: Get Started With These Top Dividend Stocks"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/blackberry-stock-growth-stock-buy-170000592.html","description":"Here's why BlackBerry (TSX:BB)(NYSE:BB) could be a long-term growth stock to consider right now, despite this recent selloff. The post BlackBerry Stock: A Growth Stock to Buy or a Has-Been? appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - BlackBerry Stock: A Growth Stock to Buy or a Has-Been?"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/tfsa-investors-100k-passive-income-170000266.html","description":"If you want $100,000 in returns in just a decade, it's certainly possible -- especially if you use your TFSA contribution room correctly! The post TFSA Investors: How to Make $100K in Passive Income in a Decade appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - TFSA Investors: How to Make $100K in Passive Income in a Decade"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/bel-air-cast-on-fresh-prince-legacy-were-standing-on-the-shoulders-of-giants-135541664.html","description":"Peacock's 'Bel-Air' — the reimagined, dramatic reboot of '90s sitcom 'The Fresh Prince of Bel-Air' — is set to make its much anticipated debut on Super Bowl Sunday.","country":"USD","title":"Editor's Pick  - 'Fresh Prince' reboot on Will Smith's legacy: 'Standing on shoulders of giants'"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/grindrod-shipping-grin-post-q4-203108322.html","description":"Improved market conditions in the drybulk business might have aided Grindrod Shipping's (GRIN) Q4 performance.","country":"USD","title":"Zacks - Grindrod Shipping (GRIN) to Post Q4 Earnings: What's in Store?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/abcellera-discovered-antibody-bebtelovimab-receives-203700737.html","description":"VANCOUVER, British Columbia, February 11, 2022--AbCellera-Discovered Antibody, Bebtelovimab, Receives U.S. FDA Emergency Use Authorization for the Treatment of Mild to Moderate COVID-19","country":"USD","title":"Business Wire - AbCellera-Discovered Antibody, Bebtelovimab, Receives U.S. FDA Emergency Use Authorization for the Treatment of Mild-to-Moderate COVID-19"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/arbor-realty-trust-closes-2-211000654.html","description":"UNIONDALE, N.Y., Feb. 11, 2022 (GLOBE NEWSWIRE) -- Arbor Realty Trust, Inc. (NYSE: ABR), today announced the closing of a $2.05 billion commercial real estate mortgage loan securitization (the “Securitization”). An aggregate of approximately $1.65 billion of investment grade-rated notes were issued (the “Notes”) and Arbor retained subordinate interests in the issuing vehicle of approximately $397 million. The $2.05 billion of collateral includes approximately $347 million of capacity to acquire","country":"USD","title":"GlobeNewswire - Arbor Realty Trust Closes a $2.05 Billion Collateralized Loan Obligation Securitization"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/don-t-buy-air-canada-143200713.html","description":"Are you still hanging on to Air Canada (TSX:AC) stock? This other stock is benefiting from a current trend. The post Don’t Buy Air Canada (TSX:AC), Buy This TSX Stock Instead appeared first on The Motley Fool Canada.","country":"USD","title":"The Motley Fool - Don’t Buy Air Canada (TSX:AC), Buy This TSX Stock Instead"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/much-aesther-healthcare-acquisition-corp-110127379.html","description":"If you want to know who really controls Aesther Healthcare Acquisition Corp. ( NASDAQ:AEHA ), then you'll have to look...","country":"USD","title":"Simply Wall St. - How Much Of Aesther Healthcare Acquisition Corp. (NASDAQ:AEHA) Do Institutions Own?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/996dd8db-ef1f-3499-a00b-da0fca4e52c1/is-affirm-holdings-stock-a.html","description":"Affirm's (NASDAQ: AFRM) stock price plunged 21% on Feb. 10 after the \"buy now, pay later\" (BNPL) services provider posted its second-quarter earnings. The report had been partly leaked earlier in the day, which prompted Affirm to release its entire earnings report ahead of schedule.","country":"USD","title":"Motley Fool - Is Affirm Holdings Stock a Buy Now?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/agra-ventures-subsidiary-farmako-positioned-220000188.html","description":"The Company Congratulates the New German Government for Making the Legalization of Recreational Cannabis and Development of a Regulatory Framework a Priority for the Country in the Near TermVANCOUVER, British Columbia, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Agra Ventures Ltd. (“AGRA” or the “Company”) (CSE: AGRA) (OTC: AGFAF) (FRA: PU30), a growth-oriented and diversified company focused on the international cannabis industry, is pleased to announce that its wholly owned subsidiary, Farmako GmbH (“Fa","country":"USD","title":"GlobeNewswire - Agra Ventures’ Subsidiary Farmako Positioned to Benefit from Germany’s Impending Legalization of Recreational Cannabis"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/3-high-yielding-dividend-stocks-163000423.html","description":"Given their robust cash flows, healthy growth prospects, and high dividend yields, these three dividend stocks could boost your passive income. The post 3 High-Yielding Dividend Stocks to Boost Your Passive Income appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 3 High-Yielding Dividend Stocks to Boost Your Passive Income"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/william-holland-independent-chairman-board-113012279.html","description":"Those following along with CI Financial Corp. ( TSE:CIX ) will no doubt be intrigued by the recent purchase of shares...","country":"CAD","title":"Simply Wall St. - William Holland Is The Independent Chairman of the Board of CI Financial Corp. (TSE:CIX) And They Just Picked Up 1.1% More Shares"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/tfsa-investors-3-growth-stocks-173000474.html","description":"Are you looking for growth stocks to help boost your TFSA? Here are three stocks to add to your portfolio today! The post TFSA Investors: 3 Growth Stocks to Add to Your Portfolio Today appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - TFSA Investors: 3 Growth Stocks to Add to Your Portfolio Today"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/cronos-group-provides-bi-weekly-003000314.html","description":"TORONTO, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Cronos Group Inc. (NASDAQ: CRON) (TSX: CRON) (“Cronos Group” or the “Company”) is providing a default status report in accordance with the alternative information guidelines set out in National Policy 12-203 – Management Cease Trade Orders (“NP 12-203”). On November 9, 2021, the Company announced that it applied for a management cease trade order (“MCTO”) with the applicable securities regulatory authorities in Canada on the basis that the Company would","country":"CAD","title":"GlobeNewswire - Cronos Group Provides Bi-Weekly MCTO Status Update"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/high-growth-stocks-buy-today-204500062.html","description":"Looking for some high-growth stocks to buy? Here are some great options to consider buying now that can offer decades of growth. The post High-Growth Stocks to Buy Today appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - High-Growth Stocks to Buy Today"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/top-2-tsx-dividend-stocks-174500403.html","description":"When investing in dividend stocks, look at free cash flow, dividend history, and future cash flow. Here are two stocks to buy under $50. The post Top 2 TSX Dividend Stocks to Buy Under $50 appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - Top 2 TSX Dividend Stocks to Buy Under $50"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/3-top-canadian-growth-stocks-180400396.html","description":"In this market environment, these three top Canadian growth stocks are some of the best investments that you can buy now and hold for years. The post 3 Top Canadian Growth Stocks to Buy for Investors of All Risk Tolerances appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 3 Top Canadian Growth Stocks to Buy for Investors of All Risk Tolerances"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/gfl-environmental-inc-files-2021-220000482.html","description":"GFL Environmental Inc. (NYSE: GFL) (TSX: GFL) (\"GFL\" or the \"Company\") today announced that it has filed its annual report on Form 40-F, including the Company's audited consolidated financial statements (the \"Financial Statements\") for the year ended December 31, 2021 with the U.S. Securities and Exchange Commission on EDGAR (www.sec.gov) and with the Canadian securities regulators on SEDAR (www.sedar.com). The annual report will also be available on the Investors page of the Company's website a","country":"CAD","title":"CNW Group - GFL Environmental Inc. Files 2021 Annual Report"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/institutions-own-agrofresh-solutions-inc-110617493.html","description":"Every investor in AgroFresh Solutions, Inc. ( NASDAQ:AGFS ) should be aware of the most powerful shareholder groups...","country":"USD","title":"Simply Wall St. - Do Institutions Own AgroFresh Solutions, Inc. (NASDAQ:AGFS) Shares?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/8aabec53-c837-3d59-ba62-9be9433a172f/want-%2410%2C000-in-yearly.html","description":"While there are a lot of ways to build wealth on Wall Street, putting your money to work in dividend stocks is among the most effective.  The first ultra-high-yield dividend stock you can buy hand over fist if you want a mountain of annual dividend income is Annaly Capital Management (NYSE: NLY).","country":"USD","title":"Motley Fool - Want $10,000 in Yearly Dividend Income? Invest $97,200 in These Ultra-High-Yield Stocks"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/armada-hoffler-properties-announces-income-215300444.html","description":"VIRGINIA BEACH, Va., Feb. 11, 2022 (GLOBE NEWSWIRE) -- Armada Hoffler Properties, Inc. (NYSE: AHH) announced the income tax treatment of its 2021 dividend distributions to holders of shares of the Company’s common stock and preferred stock. This information represents final income allocations as they will be reported on Form 1099-DIV. The tax information provided should not be construed as tax advice. Stockholders are encouraged to consult with their personal tax advisors as to their specific ta","country":"USD","title":"GlobeNewswire - Armada Hoffler Properties Announces Income Tax Treatment of Its 2021 Dividend Distributions"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/rising-popularity-vr-headsets-sparks-182755637.html","description":"Rising popularity of VR headsets sparks 31% rise in insurance claims. Metaverse gamers crashing into furniture behind increase in home contents claims, says insurer Aviva","country":"USD","title":"The Guardian - Rising popularity of VR headsets sparks 31% rise in insurance claims"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/allianz-launches-235-million-bid-213434609.html","description":"Allianz on Friday said it will pay about 207 million euros ($235 million) to acquire Greek insurer European Reliance, a move that will create the country's fifth-largest insurer based on gross written premiums.  The 7.80 euros per share bid represents a 15.7% premium to Friday's closing price, Allianz said, adding it was entering share purchase agreements covering 72% of European Reliance's shares and launch a takeover bid for the remaining stake.  \"This is an exciting opportunity for Allianz to elevate its position in the attractive Greek insurance market with an ideal entity such as European Reliance,\" Allianz management board member Sergio Balbinot said.","country":"USD","title":" - Allianz launches $235 million bid for Greece's European Reliance"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/does-alaska-air-group-nyse-111127141.html","description":"Legendary fund manager Li Lu (who Charlie Munger backed) once said, 'The biggest investment risk is not the volatility...","country":"USD","title":"Simply Wall St. - Does Alaska Air Group (NYSE:ALK) Have A Healthy Balance Sheet?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/fed-rush-catch-inflation-raises-143000793.html","description":"(Bloomberg) -- The Federal Reserve faces a growing risk of making a policy mistake, tipping the economy into a recession, as it confronts decades-high inflation that’s proving more persistent and broad-based than policy makers expected.Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Show Millennial Workers Favored Over ‘Dinobabies’U.S. O","country":"USD","title":"Bloomberg - Fed Rush to Catch Up on Inflation Raises U.S. Recession Risks"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/67fd190d-1fc1-3e57-a17f-9f113687bdbd/here's-my-top-value-stock-to.html","description":"Value stocks have been on a pretty good run the last two years, outperforming growth stocks.  For the one-year period ended Feb. 9, value stocks have returned 17%, while growth stocks have returned 11.4%, as measured by the Russell 1000 Value and Growth indexes, respectively.  Of course, the market goes in cycles, and growth stocks have beaten value stocks over the long term, generally speaking.","country":"USD","title":"Motley Fool - Here's My Top Value Stock to Buy Right Now"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/hanwei-energy-services-reports-third-220000718.html","description":"VANCOUVER, British Columbia, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Hanwei Energy Services Corp. (TSX: HE) (“Hanwei” or the “Company”), today reported its financial results for the third quarter and nine months ended December 31, 2021 (“Q3 2022” and “YTD”). All amounts are in Canadian Dollars unless otherwise noted. Financial and Operating Update Prior to the sale of its oil & gas business and FRP pipe business, Hanwei's principal business operations are in two segments of the oil and gas industry as","country":"CAD","title":"GlobeNewswire - Hanwei Energy Services Reports Third Quarter Fiscal 2022 Financial and Operational Results"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/hut-8-mining-launches-market-225900456.html","description":"Hut 8 Mining Corp. (Nasdaq: HUT) (TSX: HUT) (\"Hut 8\" or the \"Company\") announces that it has entered into an at-the-market offering agreement dated February 11, 2022 (the \"ATM Agreement\") with H.C. Wainwright & Co., LLC (the \"Agent\") as agent, pursuant to which the Company established an at-the-market equity program (the \"ATM Program\").","country":"CAD","title":"CNW Group - Hut 8 Mining Launches At-The-Market Equity Program"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/3-stocks-buy-inflation-touches-183000698.html","description":"Companies such as Loblaw, Barrick Gold, and Suncor are likely to benefit in an inflationary environment. The post 3 Stocks to Buy as Inflation Touches 40-Year Highs appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 3 Stocks to Buy as Inflation Touches 40-Year Highs"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/2-top-canadian-dividend-stocks-180000240.html","description":"Here are two top Canadian dividend stocks I think are great portfolio additions to battle this increasingly difficult macroeconomic period. The post 2 Top Canadian Dividend Stocks to Buy Before They Take Off appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 2 Top Canadian Dividend Stocks to Buy Before They Take Off"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/mcewen-mining-announces-flow-financing-023100000.html","description":"TORONTO, Feb. 11, 2022 (GLOBE NEWSWIRE) -- McEwen Mining Inc. (NYSE: MUX) (TSX: MUX) is pleased to announce a financing to fund continued exploration at the Fox Complex in the Timmins region of Ontario. These funds will be employed to build on the business case outlined in our recently announced preliminary economic assessment (see news release dated January 26, 2022). The financing consists of a US$15,080,000 (Cdn$19,212,500) private placement offering (the “Offering”) of 14,500,000 flow-throug","country":"CAD","title":"GlobeNewswire - McEwen Mining Announces Flow-Through Financing"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/2-top-stocks-rrsp-investors-190000936.html","description":"These top TSX stocks should deliver strong returns for RRSP investors in an inflationary environment. The post 2 Top Stocks for RRSP Investors to Buy in 2022 appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - 2 Top Stocks for RRSP Investors to Buy in 2022"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/nuvei-tsx-nvei-growth-stock-123500913.html","description":"Nuvei stock (TSX:NVEI)(NASDAQ:NVEI) looks oversold and overdue for a pop, even with short-seller allegations fresh in investors' minds in 2022. The post Nuvei (TSX:NVEI): A Growth Stock That Looks Intriguing After its Crash appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - Nuvei (TSX:NVEI): A Growth Stock That Looks Intriguing After its Crash"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/orvana-reports-q1-fy2022-results-224200491.html","description":"Orvana Minerals Corp. (TSX: ORV) (the \"Company\" or \"Orvana\") reports consolidated financial and operational results for the quarter ended December 31, 2021, and announces that it will file on SEDAR the updated independent preliminary economic assessment report (the \"2021 Taguas PEA\") for the Taguas Project (\"Taguas\") located in San Juan Province, Argentina. The 2021 Taguas PEA was prepared in accordance with National Instrument 43-101 Standards of Disclosure for Mineral Projects and the key 2021","country":"CAD","title":"CNW Group - ORVANA REPORTS Q1 FY2022 RESULTS AND ANNOUNCES FILING OF PEA NI 43-101 REPORT FOR TAGUAS"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/parkland-corporation-announces-february-2022-223000058.html","description":"Parkland Corporation (\"Parkland\") (TSX: PKI) announces that a dividend of $0.1029 per share will be paid on March 15, 2022 to shareholders of record on February 23, 2022. The dividend will be an 'eligible dividend' for Canadian income tax purposes. The ex-dividend date is February 22, 2022.","country":"CAD","title":"CNW Group - Parkland Corporation Announces February 2022 Dividend"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/pimco-canada-corp-announces-monthly-192400227.html","description":"Not for distribution to United States newswire services or for dissemination in the United States TORONTO, Feb. 11, 2022 (GLOBE NEWSWIRE) -- PIMCO Canada Corp. (“PIMCO Canada”) today announced the 2022 February cash distributions for the ETF series (“ETF Series”) of the PIMCO Canada mutual funds that distribute monthly (“Funds”). Unitholders of record of the ETF Series, at the close of business on February 18, 2022, will receive per-unit cash distribution payable on or about February 28, 2022. D","country":"CAD","title":"GlobeNewswire - PIMCO Canada Corp. Announces Monthly Distributions for PIMCO Canada Exchange Traded Series"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/platinum-group-metals-ltd-completes-213000948.html","description":"Vancouver, British Columbia and Johannesburg, South Africa--(Newsfile Corp. - February 11, 2022) - Platinum Group Metals Ltd. (TSX: PTM) (NYSE American: PLG) (\"Platinum Group\", \"PTM\" or the \"Company\") has completed the privately negotiated purchase and cancellation of the Company's US $20 million 6 7/8% Convertible Senior Subordinated Notes (the \"Notes\") due July 1, 2022 pursuant to the agreements previously announced on January 20, 2022. On the purchase of the Notes, the Company issued ...","country":"CAD","title":"Newsfile - Platinum Group Metals Ltd. Completes Purchase and Cancellation of US $20 Million Convertible Notes"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/tfsa-pension-2-top-tsx-191500032.html","description":"These top TSX stocks have made some long-term investors wealthy and still look good to buy for a TFSA. The post TFSA Pension: 2 Top TSX Stocks to Help You Retire Rich appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - TFSA Pension: 2 Top TSX Stocks to Help You Retire Rich"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/easily-over-465-month-tax-210000241.html","description":"Canadians looking to combat market turbulence can generate passive income through stocks like Sienna Senior Living Inc. (TSX:SIA) in a TFSA. The post How to Easily Make Over $465/Month in TAX-FREE Passive Income! appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - How to Easily Make Over $465/Month in TAX-FREE Passive Income!"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/buy-alert-tsx-operator-hikes-150000895.html","description":"The TSX operator is the top value stock today, given its favourable business outlook and visible growth potential. The post Buy Alert: TSX Operator Hikes Dividend by 8% After Profit Pops 22% appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - Buy Alert: TSX Operator Hikes Dividend by 8% After Profit Pops 22%"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/1-td-bank-freezes-two-165134096.html","description":"Toronto-Dominion Bank has frozen two personal bank accounts into which C$1.4 million ($1.1 million) had been deposited to support protesters fighting the Canadian government's pandemic measures, a bank spokesperson said on Saturday.  The demonstrations, dubbed the \"Freedom Convoy\" by Canadian truckers opposing a vaccination mandate https://www.reuters.com/article/health-coronavirus-canada-trucking-idCNL1N2UK2CD for cross-border drivers as well as other pandemic restrictions, are now in their third week.  Early on Saturday, Canadian police began clearing protesters https://www.reuters.com/article/healthcoronavirus-canada-trucking/update-1-canada-police-start-to-clear-protesters-blocking-u-s-canada-bridge-idINL1N2UN09T blocking a key bridge linking Canada and the United States.","country":"CAD","title":" - UPDATE 1-TD Bank freezes two accounts that received C$1.4 mln in support of Canada protests"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/price-performer-22-1-auto-215200194.html","description":"A cheap and obscure auto parts stock could be a high-flyer in 2022 due to the alternative fuel auto industry boom. The post Price Performer in ’22: 1 Auto Parts Stock With a 450% Upside appeared first on The Motley Fool Canada.","country":"CAD","title":"The Motley Fool - Price Performer in ’22: 1 Auto Parts Stock With a 450% Upside"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/alvopetro-engages-market-maker-220500264.html","description":"Alvopetro Energy Ltd. (TSXV: ALV) (OTCQX: ALVOF) announces that, subject to regulatory approval, it has engaged the services of Independent Trading Group (\"ITG\") to provide market-making services in accordance with TSX Venture Exchange policies. ITG will trade shares of the Company on the TSXV and all other trading venues with the objective of maintaining a reasonable market and improving the liquidity of the Company's common shares. Under the agreement, ITG will receive compensation of CAD$4,00","country":"USD","title":"CNW Group - Alvopetro Engages Market Maker"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/dd974580-e9ef-381e-a3f8-3ae5aa1b0185/why-amc-entertainment-soared.html","description":"Shares of AMC Entertainment (NYSE: AMC) were up in lights again last week, jumping 22.5% from where they closed a week ago Friday, according to data by S&P Global Market Intelligence.  Although the stock is still down 74% from the heights attained during the meme stock trading frenzy a year ago, and are off over 30% in 2022 alone, the reversal of fortune is a welcome reprieve for investors in the movie theater operator.  AMC made a number of announcements this past week that investors see as benefiting the theater chain over the long haul, not least of which was refinancing some $950 million worth of its debt that will reduce its interest payments by $24 million.","country":"USD","title":"Motley Fool - Why AMC Entertainment Soared 22% This Week"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/a8c57547-49d3-39d3-8b8a-bfb6412f095b/why-amd-and-nvidia-were-down.html","description":"Nvidia (NASDAQ: NVDA) is expected to report a strong quarter during its earnings call on Feb. 16, after Advanced Micro Devices (NASDAQ: AMD) crushed its recent earnings.  Today's video focuses on the short-term volatility that could be impacting the semiconductor industry, even though earnings continue to beat expectations.  Investors who want to keep a close eye on the semiconductor industry should watch Taiwan Semiconductor Manufacturing (NYSE: TSM).","country":"USD","title":" - Why AMD and Nvidia Were Down on Friday"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/anika-reports-inducement-grants-under-235000395.html","description":"BEDFORD, Mass., Feb. 11, 2022 (GLOBE NEWSWIRE) -- Anika Therapeutics, Inc. (NASDAQ: ANIK), a global joint preservation company in early intervention orthopedics, today announced that on February 1, 2022, Anika granted non-statutory stock options covering an aggregate of 10,428 shares of common stock (the “Options”) and restricted stock units (the “RSUs”) covering an aggregate of 4,699 shares of common stock to 3 newly hired non-executive employees. Each grant was made pursuant to the Anika Thera","country":"USD","title":"GlobeNewswire - Anika Reports Inducement Grants Under Nasdaq Listing Rule 5635(c)(4)"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/ampco-pittsburgh-appoints-three-independent-213800139.html","description":"CARNEGIE, Pa., February 11, 2022--Ampco-Pittsburgh Corporation (NYSE: AP) (\"Ampco-Pittsburgh\" or the \"Corporation\") today announced that it has appointed three independent directors to its Board of Directors (the \"Board\"), two of whom were appointed in connection with an agreement with Ancora Holdings Group, LLC (together with its affiliates, \"Ancora\"), a shareholder which currently owns approximately 5.6% of the Corporation’s outstanding shares. Frederick D. DiSanto and Darrell L. McNair will j","country":"USD","title":"Business Wire - Ampco-Pittsburgh Appoints Three Independent Directors to the Board"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/abde4c73-ef9d-3acd-b049-c5bb0b791252/2-dividend-stocks-that-will.html","description":"Let's take a look at how NextEra Energy (NYSE: NEE) and Air Products & Chemicals (NYSE: APD) fit these requirements and could set investors up with a lifetime of growing dividends.  With a market capitalization of $151 billion, NextEra Energy is the largest publicly-traded utility in the world.  NextEra Energy serves 5.6 million customer accounts and over 11 million customers in Florida through its Florida Power & Light Company (FPL) subsidiary, which is the largest rate-regulated electric utility in the U.S. Via its NextEra Energy Resources subsidiary, NextEra Energy is the largest generator of renewable energy in the world.","country":"USD","title":"Motley Fool - 2 Dividend Stocks That Will Pay You for Life"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/artesian-resources-corporations-nasdaq-artn-111559319.html","description":"Artesian Resources' (NASDAQ:ARTN.A) stock is up by 7.6% over the past three months. However, we decided to study the...","country":"USD","title":"Simply Wall St. - Artesian Resources Corporation's (NASDAQ:ARTN.A) Financials Are Too Obscure To Link With Current Share Price Momentum: What's In Store For the Stock?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/eps-growth-then-check-australian-231521516.html","description":"It's only natural that many investors, especially those who are new to the game, prefer to buy shares in 'sexy' stocks...","country":"USD","title":"Simply Wall St. - If You Like EPS Growth Then Check Out Australian Agricultural (ASX:AAC) Before It's Too Late"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/m/36f0a3fd-0232-3910-b34e-ce53576d1cec/3-no-brainer-dividend-stocks.html","description":"Stock market crashes can be difficult to endure.  While not all dividends can withstand a prolonged economic downturn that usually causes a crash, some stand out for their ability to not only maintain their dividend payments but also continue to grow them during tough times.  Three of these crash-proof dividend stocks are Enterprise Products Partners (NYSE: EPD), Waste Connections (NYSE: WCN), and Brookfield Infrastructure (NYSE: BIPC)(NYSE: BIP).","country":"CAD","title":"Motley Fool - 3 No-Brainer Dividend Stocks to Own in a Market Crash"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/wesdome-gold-mines-ltd-tse-171756699.html","description":"Wesdome Gold Mines' (TSE:WDO) stock is up by a considerable 11% over the past week. Since the market usually pay for a...","country":"CAD","title":"Simply Wall St. - Wesdome Gold Mines Ltd.'s (TSE:WDO) Stock Is Going Strong: Is the Market Following Fundamentals?"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/west-fraser-timber-tse-wfg-182933083.html","description":"Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of...","country":"CAD","title":"Simply Wall St. - Is West Fraser Timber (TSE:WFG) Using Too Much Debt?"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/benchmark-drills-13-metres-23-211500975.html","description":"Edmonton, Alberta--(Newsfile Corp. - February 11, 2022) - Benchmark Metals Inc. (TSXV: BNCH) (OTCQX: BNCHF) (WKN: A2JM2X) (the \"Company\" or \"Benchmark\") is pleased to announce new results from 3 multi-purpose drill holes at the AGB Deposit including 101.60 metres (m) of 4.68 grams per tonne (g/t) gold and 89.89 g/t silver or 5.80 g/t gold equivalent (AuEq*) with 13.00 m of 23.72 g/t gold and 212.84 g/t silver or 26.38 g/t AuEq in drill hole ...","country":"CAD","title":"Newsfile - Benchmark Drills 13 Metres of 23.72 g/t Gold and 212.84 g/t Silver Within a Broader Zone of 101.60 Metres of 4.68 g/t Gold and 89.89 g/t Silver or 5.80 g/t Gold Equivalent from Surface at the AGB Deposit"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/edison-lithium-corp-provides-status-020000318.html","description":"Vancouver, British Columbia--(Newsfile Corp. - February 11, 2022) - Edison Lithium Corp. (TSXV: EDDY) (OTCQB: EDDYF) (FSE: VV0) (\"Edison\" or the \"Company\") is providing this bi-weekly default status report in accordance with National Policy 12-203 Management Cease Trade Orders (\"NP 12-203\").On January 31, 2022, the Company announced that it had made application to the British Columbia Securities Commission, under NP 12-203, requesting that a temporary management cease trade order (\"MCTO\") be gra","country":"CAD","title":"Newsfile - Edison Lithium Corp. Provides Status Update to Management Cease Trade Order"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/euro-manganese-clarifies-participant-details-213000839.html","description":"VANCOUVER, British Columbia, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Euro Manganese Inc. (TSX-V and ASX: EMN; OTCQX: EUMNF; Frankfurt: E06) (the “Company” or “EMN”) wishes to clarify the date and time for investors located in Australia wishing to listen in on the Company’s investor call to be held Monday, February 14, 2022 at 1.30 pm Vancouver time, (Tuesday, February 15, 2022 at 8.30 am AEDT), and provide a toll-free number for Australian investors and participants wishing to ask questions. Details f","country":"CAD","title":"GlobeNewswire - Euro Manganese Clarifies Participant Details for its Investor Call"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/forward-water-technologies-announces-letter-161500401.html","description":"TORONTO, ON / ACCESSWIRE / February 5, 2022 / Forward Water Technologies Corp. (\"Forward Water\" or the \"Company\") (TSXV:FWTC) is pleased to announce that it has entered into a non-binding letter of intent dated February 3, 2022 with Membracon (UK) Ltd.","country":"CAD","title":" - Forward Water Technologies Announces Letter of Intent with Membracon UK"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/three-shareholder-returns-company-earnings-112059695.html","description":"Investing in stocks inevitably means buying into some companies that perform poorly. But the long term shareholders of...","country":"USD","title":"Simply Wall St. - The three-year shareholder returns and company earnings persist lower as Adtalem Global Education (NYSE:ATGE) stock falls a further 16% in past week"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/7e4bd9f4-f98b-351a-9281-42d965097736/microsoft-acquisition-the.html","description":"In mid-January, Microsoft (NASDAQ: MSFT) announced its plans to acquire troubled video game company Activision Blizzard (NASDAQ: ATVI) in a blockbuster $68.7 billion deal.  In this episode of \"The Gaming Show\" on Motley Fool Live, recorded on Jan. 31, Motley Fool analyst Jon Quast and Fool.com contributor Jose Najarro discuss why joining the tech juggernaut could be the perfect move for Activision.","country":"USD","title":" - Microsoft Acquisition the \"Best Thing to Ever Happen to Activision Blizzard\""},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/auburn-national-bancorporation-nasdaq-aubn-110440289.html","description":"The board of Auburn National Bancorporation, Inc. ( NASDAQ:AUBN ) has announced that it will be increasing its dividend...","country":"USD","title":"Simply Wall St. - Auburn National Bancorporation (NASDAQ:AUBN) Will Pay A Larger Dividend Than Last Year At US$0.27"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/austal-limited-asx-asb-popular-215228711.html","description":"If you want to know who really controls Austal Limited ( ASX:ASB ), then you'll have to look at the makeup of its share...","country":"USD","title":"Simply Wall St. - Is Austal Limited (ASX:ASB) Popular Amongst Institutions?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/auxico-provides-management-cease-trade-220000378.html","description":"Auxico Resources Canada Inc. (CSE: AUAG) is providing an update to its previously disclosed management cease trade order (\"MCTO\"), announced on January 28, 2022, in respect of the audited annual financial statements and corresponding management's discussion and analysis for the year ended September 30, 2021, including the CEO and CFO certifications (collectively, the \"Annual Financial Filings\") that were not filed by the required filing deadline of January 28, 2022 (the \"Filing Deadline\").","country":"USD","title":"CNW Group - AUXICO PROVIDES UPDATE ON MANAGEMENT CEASE TRADE ORDER"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/82920782-c0bc-359e-9f59-8995e9836753/3-top-energy-dividend-stocks.html","description":"The stock market has gotten off to a rocky start in 2022.  Three that stand out are Brookfield Renewable (NYSE: BEPC)(NYSE: BEP), Atlantica Sustainable Infrastructure (NASDAQ: AY), and NextEra Energy (NYSE: NEE).","country":"USD","title":"Motley Fool - 3 Top Energy Dividend Stocks to Buy in February"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/aa622840-bd9e-307f-abe5-c33613bda974/2-top-healthcare-stocks-to.html","description":"With the global population projected to reach 9.7 billion by 2050, more individuals around the world will at some point require medical devices, prescriptions, or other medical care.  Let's dig into how these trends will benefit Medtronic (NYSE: MDT) and AstraZeneca (NASDAQ: AZN) and why each stock appears attractive right now.  Medtronic is the largest pure-play medical devices company in the world with over 90,000 employees across more than 150 countries.","country":"USD","title":"Motley Fool - 2 Top Healthcare Stocks to Buy Right Now"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/barnes-group-b-earnings-expected-200008813.html","description":"Barnes Group (B) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.","country":"USD","title":"Zacks - Barnes Group (B) Earnings Expected to Grow: Should You Buy?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/brightcove-reports-inducement-grants-ceo-210500776.html","description":"BOSTON, February 11, 2022--Brightcove Inc. (Nasdaq: BCOV), the leading intelligent video streaming, monetization, and communications platform, announced on Wednesday, February 9, 2022 that the Company entered into an employment agreement with Marc DeBevoise (the \"Agreement\") which provides for the grant of restricted stock unit awards to Mr. DeBevoise effective as of April 4, 2022. These inducement awards were approved on February 8, 2022 by a majority of the independent members of the Brightcov","country":"USD","title":" - Brightcove Reports Inducement Grants to CEO Marc DeBevoise Under Nasdaq Listing Rule 5635(c)(4)"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/investors-bombardier-tse-bbd-b-122418835.html","description":"Bombardier Inc. ( TSE:BBD.B ) shareholders might be concerned after seeing the share price drop 11% in the last...","country":"USD","title":"Simply Wall St. - Investors in Bombardier (TSE:BBD.B) have made a strong return of 176% over the past year"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/time-buy-renewables-stock-3-173000274.html","description":"Here's why Brookfield Renewables (TSX:BEP.UN)(NYSE:BEP) is a top renewables stock to think about from a dividend and value perspective. The post It’s Time to Buy This Renewables Stock With a 3.6% Yield appeared first on The Motley Fool Canada.","country":"USD","title":"The Motley Fool - It’s Time to Buy This Renewables Stock With a 3.6% Yield"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/1101b8e1-66f7-3756-b14d-cc723b3cf3fa/what-to-expect-from-biogen's.html","description":"After selling its stake in a biosimilar joint venture with Samsung Biologics, Biogen (NASDAQ: BIIB) has reportedly now brought Goldman Sachs on board to identify potential acquisition targets.  Brian Orelli: Biogen sold off its stake in its biosimilar joint venture that it has with Samsung Biologics.","country":"USD","title":" - What to Expect From Biogen's $2.3 Billion Shopping Spree"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/lady-turns-3k-bitcoin-320k-184758107.html","description":"Leading Israeli bank files to dismiss Esther Freeman’s claims after rejecting the $320K profit she made from holding Bitcoin since 2013.","country":"USD","title":"FX Empire - Lady Turns $3K Bitcoin to $320K but Israeli Bank Calls for Claim Denial"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/booking-com-eliminate-2-700-224545005.html","description":"After Booking Holdings laid off about 25 percent of its workforce across 60 countries in 2020 and 2021 because of the pandemic, its Booking.com unit is lopping off another 2,700 call center jobs in the next few months. The employees of about a dozen call centers, but not staff in Amsterdam or Manchester, UK, will […]","country":"USD","title":"Skift - Booking.com to Eliminate 2,700 Customer Service Jobs"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/bloomin-brands-blmn-earnings-expected-200008638.html","description":"Bloomin' Brands (BLMN) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.","country":"USD","title":"Zacks - Bloomin' Brands (BLMN) Earnings Expected to Grow: What to Know Ahead of Next Week's Release"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/blink-charging-blnk-flat-market-231511131.html","description":"Blink Charging (BLNK) closed the most recent trading day at $23.70, making no change from the previous trading session.","country":"USD","title":"Zacks - Blink Charging (BLNK) Flat As Market Sinks: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/banco-bpm-says-no-contact-105134618.html","description":"(Bloomberg) -- Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Show Millennial Workers Favored Over ‘Dinobabies’Biden’s White House Makes a Telling MistakeBankers based in Italy are meeting in the northern town of Parma at the Assiom Forex conference as the banking industry looks at possible consolidation amid rising profits and a resurg","country":"USD","title":"Bloomberg - Banco BPM Says No Contact With UniCredit: Italian Banking Update"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/u-fda-postpones-panel-meeting-184811120.html","description":"Feb 11 (Reuters) - The U.S. Food and Drug Administration said it was postponing the advisory committee meeting to discuss request for authorization of Pfizer-Biontech COVID-19 vaccine for children 6 months through 4 years of age.","country":"USD","title":"Reuters - U.S. FDA postpones panel meeting to discuss Pfizer COVID vaccine for kids under 5"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/companies-bolt-biotherapeutics-nasdaq-bolt-113030918.html","description":"We can readily understand why investors are attracted to unprofitable companies. For example, although Amazon.com made...","country":"USD","title":"Simply Wall St. - Companies Like Bolt Biotherapeutics (NASDAQ:BOLT) Are In A Position To Invest In Growth"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/boston-omaha-corporation-announces-nyse-211300738.html","description":"OMAHA, Nebraska, February 11, 2022--Boston Omaha Corporation (\"Boston Omaha\" or the \"Company\") (NYSE: BOMN) announced today that it will be changing its ticker symbol from \"BOMN\" to \"BOC\". Effective on Tuesday, February 22, 2022, the Company’s common shares will trade on the New York Stock Exchange (NYSE) under the new symbol \"BOC\".","country":"USD","title":"Business Wire - Boston Omaha Corporation Announces NYSE Ticker Symbol Change from BOMN to BOC"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/capital-allocation-trends-brooge-energy-113525511.html","description":"If we want to find a potential multi-bagger, often there are underlying trends that can provide clues. Ideally, a...","country":"USD","title":"Simply Wall St. - Capital Allocation Trends At Brooge Energy (NASDAQ:BROG) Aren't Ideal"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/bt-brands-inc-nasdaq-btbd-114017283.html","description":"Unfortunately for some shareholders, the BT Brands, Inc. ( NASDAQ:BTBD ) share price has dived 25% in the last thirty...","country":"USD","title":"Simply Wall St. - BT Brands, Inc.'s (NASDAQ:BTBD) 25% Cheaper Price Remains In Tune With Earnings"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/independent-director-bridgewater-bancshares-inc-110728322.html","description":"Potential Bridgewater Bancshares, Inc. ( NASDAQ:BWB ) shareholders may wish to note that the Independent Director...","country":"USD","title":"Simply Wall St. - The Independent Director of Bridgewater Bancshares, Inc. (NASDAQ:BWB), Mohammed Lawal, Just Bought 315% More Shares"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/bowman-consulting-group-announces-closing-213200346.html","description":"RESTON, Va., February 11, 2022--Bowman Consulting Group Ltd. (Nasdaq: BWMN) (\"Bowman\"), a national engineering services firm supporting owners and developers of the built environment, announced today the closing of its previously announced follow-on public offering at $16.00 per share. A total of 900,000 shares of common stock were sold by Bowman and 150,000 shares of common stock were sold by an existing stockholder of Bowman. The net proceeds to Bowman from the follow-on offering are approxima","country":"USD","title":"Business Wire - Bowman Consulting Group Announces Closing of Follow-On Public Offering"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/kind-shareholders-own-chesapeake-utilities-135619624.html","description":"Every investor in Chesapeake Utilities Corporation ( NYSE:CPK ) should be aware of the most powerful shareholder...","country":"USD","title":"Simply Wall St. - What Kind Of Shareholders Own Chesapeake Utilities Corporation (NYSE:CPK)?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/cardinal-health-nyse-cah-affirmed-111020765.html","description":"Cardinal Health, Inc. ( NYSE:CAH ) has announced that it will pay a dividend of US$0.49 per share on the 15th of April...","country":"USD","title":"Simply Wall St. - Cardinal Health (NYSE:CAH) Has Re-Affirmed Its Dividend Of US$0.49"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/ryder-declares-quarterly-cash-dividend-213000289.html","description":"MIAMI, February 11, 2022--The Board of Directors of Ryder System, Inc. (NYSE: R), a leader in supply chain, dedicated transportation, and fleet management solutions, today declared a regular quarterly cash dividend of $0.58 per share of common stock to be paid on March 18, 2022 to shareholders of record on February 22, 2022.","country":"CAD","title":"Business Wire - Ryder Declares Quarterly Cash Dividend"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/wescan-announces-proposed-private-placement-013700777.html","description":"Wescan Goldfields Inc. (\"Wescan\" or the \"Company\") is pleased to announce that it is undertaking a private placement financing consisting of an aggregate of up to 2,777,778 Flow-Through Common Shares of the Company at a price of $0.09 per Flow-Through Common Share and an aggregate of up to 3,571,429 Units of the Company at a price of $0.07 per Unit, for gross proceeds of up to $500,000 (collectively, the \"Offering\"). Each Unit is comprised of one common share and one warrant. Each whole warrant","country":"CAD","title":"CNW Group - WESCAN ANNOUNCES PROPOSED PRIVATE PLACEMENT"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/boosh-acquires-beanfields-003100264.html","description":"Vancouver, British Columbia--(Newsfile Corp. - February 11, 2022) - Boosh Plant-Based Brands Inc. (CSE: VEGI) (OTCQB: VGGIF) (FSE: 77i) (\"Boosh\" or the \"Company\") is pleased to announce that today it executed an asset purchase agreement to acquire substantially all of the assets of Beanfields Inc. (the \"Assets\").The acquisition reflects the Company's strategy taking hold, providing value creation and an instantly accretive opportunity for shareholders, bringing a leading brand into the Boosh por","country":"CAD","title":"Newsfile - Boosh Acquires Beanfields"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/brascan-announces-closing-third-final-211500914.html","description":"NOT FOR DISSEMINATION IN THE UNITED STATES OR DISTRIBUTION TO U.S. NEWS WIRE SERVICES VANCOUVER, British Columbia, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Brascan Gold Inc. (CSE:BRAS) (FRANKFURT: 5ZT; WKN: A3C5EX ) (“Brascan” or the “Company”) is pleased to announce that it has completed the third and final tranche (the “Third Tranche”) of its non-brokered private placement (the “Private Placement”) previously announced on October 13, 2021, of 1,593,500 units (the “Units”) at a price of $0.30 per Unit","country":"CAD","title":" - Brascan Announces Closing of Third and Final Tranche Non-Brokered Private Placement of Units"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/cognetivity-neurosciences-closes-second-tranche-213000993.html","description":"Cognetivity Neurosciences Ltd. (the \"Company\" or \"Cognetivity\") (CSE: CGN) (OTCQB: CGNSF) (FRA: 1UB), a technology company that has created a cognitive testing platform for use in medical, commercial and consumer environments, is pleased to announce, further to its news releases dated December 15, 2021 and January 28, 2022, that it has closed the second tranche of the Company's non-brokered private placement (the \"Private Placement\") of units (the \"Units\"). The Company intends to complete (an) a","country":"CAD","title":"CNW Group - Cognetivity Neurosciences Closes Second Tranche of Unit Offering"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/corporate-210000357.html","description":"VANCOUVER, BC / ACCESSWIRE / February 11, 2022 / Northern Lights Resources Corp. (\"Northern Lights\", \"NLR\" or the \"Company\")(CSE:NLR)(OTC:NLRCF) announces that it has issued 10,655,833 common shares of the Company to Mirabel Capital Ltd (the \"Investor\") under the terms of the convertible security agreement announced May 28, 2021 (the \"Conversion Shares\").","country":"CAD","title":" - Corporate Update"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/ortho-regenerative-technologies-announces-3-133500834.html","description":"Ortho Regenerative Technologies Inc. (CSE: ORTH) (OTC: ORTIF) (\"Ortho\" or the \"Company\"), a clinical-stage orthobiologics company focused on the development of novel soft tissue repair regenerative technologies, announced today a non-brokered private placement of units for maximum gross proceeds of $3.0 million (the \"Offering\").","country":"CAD","title":"CNW Group - ORTHO REGENERATIVE TECHNOLOGIES ANNOUNCES $3 MILLION NON-BROKERED PRIVATE PLACEMENT OF UNITS"},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/early-warning-press-release-respect-233600360.html","description":"TORONTO, February 11, 2022--SOL Global Investments Corp. (the \"Company\" or \"SOL Global\") (CSE: SOL) (OTCQ SOLCF) (Frankfurt: 9SB) announces that on February 3, 2022, the Company disposed of an aggregate of 1,300,000 common shares (each a \"Common Share\") of Atmofizer Technologies Inc. (\"Atmofizer\") (the \"Disposition\"). As a result of the Disposition, SOL Global now holds less than 10% of the issued and outstanding Common Shares on a partially diluted basis.","country":"CAD","title":" - Early Warning Press Release in Respect of Atmofizer Technologies Inc."},{"source":"fin_news_nlp/yahoo_cad_tickers_news","url":"https://ca.finance.yahoo.com/news/taat-deploying-incentive-program-chain-210100065.html","description":"Picture 1 In 2022 TAAT™ is embracing its existing relationships with national and regional chains of tobacco retailers including gas stations, convenience stores, smoke shops, and liquor stores as such chains commonly have existing infrastructure for incentive programs such as the sample initiative to be deployed by the Company this quarter. Picture 2 Chain stores carrying TAAT™ who opt to participate in the retailer incentive program will receive countertop displays for TAAT™ Twos (shown above)","country":"CAD","title":"GlobeNewswire - TAAT™ Deploying Incentive Program for Chain Retailers to Bolster In-Store Conversions"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/michael-dwozan-independent-vice-chairman-111311473.html","description":"Potential Colony Bankcorp, Inc. ( NASDAQ:CBAN ) shareholders may wish to note that the Independent Vice Chairman of the...","country":"USD","title":"Simply Wall St. - Michael Dwozan Is The Independent Vice Chairman of the Board of Colony Bankcorp, Inc. (NASDAQ:CBAN) And They Just Picked Up 20% More Shares"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/cnb-financial-nasdaq-ccne-announced-111602322.html","description":"CNB Financial Corporation ( NASDAQ:CCNE ) has announced that it will pay a dividend of US$0.17 per share on the 15th of...","country":"USD","title":"Simply Wall St. - CNB Financial (NASDAQ:CCNE) Has Announced A Dividend Of US$0.17"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/carlyle-group-nasdaq-cg-announced-111851949.html","description":"The board of The Carlyle Group Inc. ( NASDAQ:CG ) has announced that it will pay a dividend of US$0.25 per share on the...","country":"USD","title":"Simply Wall St. - Carlyle Group (NASDAQ:CG) Has Announced A Dividend Of US$0.25"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/investors-cullinan-oncology-nasdaq-cgem-115008791.html","description":"The nature of investing is that you win some, and you lose some. Anyone who held Cullinan Oncology, Inc. ( NASDAQ:CGEM...","country":"USD","title":"Simply Wall St. - Investors in Cullinan Oncology (NASDAQ:CGEM) have unfortunately lost 66% over the last year"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/fidelity-fis-report-q4-earnings-204808869.html","description":"Fidelity's (FIS) Q4 earnings are likely to have been aided by higher revenues in the Merchant Solutions and the Banking Solutions business, while cost woes are expected to have been a deterrent.","country":"USD","title":"Zacks - Fidelity (FIS) to Report Q4 Earnings: What's in the Cards?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/clickstream-files-form-12b-25-004000330.html","description":"BEVERLY HILLS, CA / ACCESSWIRE / February 11, 2022 / ClickStream Corp. (OTC PINK:CLIS), a technology company focused on developing apps and digital platforms that disrupt conventional industries, today announced the Company has filed Form 12b-25 for extension to file Form 10-Q for the quarter ended December 31st, 2021 with the Securities and Exchange Commission.","country":"USD","title":" - ClickStream Files Form 12b-25 for Extension to File Form 10-Q for Quarter Ending December 31st, 2021"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/monthly-information-share-capital-company-213000712.html","description":"(Article 223-16 of General Regulation of the French financial markets authority)NEW YORK, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Listing market: Euronext Growth ISIN code: FR0010425595 DateTotal number of sharesin the capitalTotal number of voting rights01/31/202245,484,31051,085,785 About Cellectis Cellectis is a clinical-stage biotechnology company using its pioneering gene-editing platform to develop life-saving cell and gene therapies. Cellectis utilizes an allogeneic approach for CAR-T immunothe","country":"USD","title":"GlobeNewswire - Monthly information on share capital and company voting rights"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/199595c9-49ee-329a-ac7b-3c00013fbac8/clean-energy's-commercial.html","description":"For more than 20 years, Clean Energy Fuels (NASDAQ: CLNE) has targeted commercial businesses to convert their diesel or gasoline-based fleets to renewable natural gas.  In this segment of \"The High Energy Show\" on Motley Fool Live, recorded on Feb. 1, Fool contributors  Jason Hall, Travis Hoium, and John Bromels discuss the current state of affairs for the company and its plans for the future.  For the RNG supply, their long-term existence as a business, this is a company that's been around since the late 1990s, T. Boone Pickens and Andrew Littlefair were the co-founders, Andrew Littlefair is still the CEO of the company.","country":"USD","title":" - Clean Energy's Commercial Vision for Renewable Natural Gas Fuel Stations"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/canadian-national-railway-tse-cnr-133537868.html","description":"Canadian National Railway Company's ( TSE:CNR ) dividend will be increasing to CA$0.73 on 31st of March. This makes the...","country":"USD","title":"Simply Wall St. - Canadian National Railway (TSE:CNR) Will Pay A Larger Dividend Than Last Year At CA$0.73"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/corning-natural-gas-holding-corporation-223500411.html","description":"CORNING, N.Y., Feb. 11, 2022 (GLOBE NEWSWIRE) -- Corning Natural Gas Holding Corporation (OTCQX: CNIG) announced consolidated earnings of $403,222 or $0.13 per share for its first quarter ended December 31, 2021. This compares to consolidated earnings of $122,108 or $0.04 per share for its first quarter ended December 31, 2020. CFO Chuck Lenns stated, “The company saw earnings increase principally due to both electric and gas rate increases at Pike County Light & Power that were partially offset","country":"USD","title":"GlobeNewswire - Corning Natural Gas Holding Corporation Reports Quarterly Earnings"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/2-top-growth-stocks-superior-141500372.html","description":"Considering the strong growth potential, these two TSX stocks could be excellent additions to your investment portfolio this year. The post 2 Top Growth Stocks for Superior Returns in 2022 appeared first on The Motley Fool Canada.","country":"USD","title":"The Motley Fool - 2 Top Growth Stocks for Superior Returns in 2022"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/ea737ca7-80a8-3597-a6ec-7c07462da227/mr.-cooper-group-inc.-(coop).html","description":"Thank you for standing by, and welcome to Mr. Cooper Group Q4 2021 earnings conference call.  With me today are Jay Bray, chairman and CEO; Chris Marshall, vice chairman, president, and CFO; and Jaime Gow, deputy CFO.","country":"USD","title":"Motley Fool - Mr. Cooper Group Inc. (COOP) Q4 2021 Earnings Call Transcript"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/corcept-therapeutics-incorporateds-nasdaq-cort-115452204.html","description":"With its stock down 13% over the past three months, it is easy to disregard Corcept Therapeutics (NASDAQ:CORT...","country":"USD","title":"Simply Wall St. - Corcept Therapeutics Incorporated's (NASDAQ:CORT) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/based-roe-copa-holdings-nyse-115939489.html","description":"Many investors are still learning about the various metrics that can be useful when analysing a stock. This article is...","country":"USD","title":"Simply Wall St. - Based On Its ROE, Is Copa Holdings, S.A. (NYSE:CPA) A High Quality Stock?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/counter-press-acquisition-corporation-announces-210000460.html","description":"NEW YORK, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Counter Press Acquisition Corporation (the “Company”) today announced the closing of its initial public offering of 8,625,000 units at a price of $10.00 per unit, including 1,125,000 units issued pursuant to the exercise by the underwriters of their over-allotment option in full. The units are listed on The Nasdaq Global Market (“Nasdaq”) and began trading under the ticker symbol “CPAQU” on February 9, 2022. Each unit consists of one share of Class A o","country":"USD","title":" - Counter Press Acquisition Corporation Announces Closing of $86.25 Million Initial Public Offering"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/credit-agricole-focus-internal-growth-092134546.html","description":"Credit Agricole will focus on internal growth to further boost its presence in Italy, the head of its Italian operations said in a newspaper interview published on Saturday.  \"Organic growth is the priority for Credit Agricole Italia,\" Giampiero Maioli told financial daily Il Sole 24 Ore.  Italy is Credit Agricole's biggest foreign market and consolidation in the sector is again heating up.","country":"USD","title":"Reuters - Credit Agricole to focus on internal growth to expand in Italy - paper"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/credo-announces-closing-initial-public-213000271.html","description":"SAN JOSE, Calif., Jan. 31, 2022 (GLOBE NEWSWIRE) -- Credo Technology Group Holding Ltd (“Credo”) (Nasdaq: CRDO) today announced the closing of its initial public offering of 20,000,000 of its ordinary shares at an initial public offering price of $10.00 per share. An aggregate of 18,383,800 of the shares were offered by Credo and 1,616,200 shares were offered by selling shareholders. The aggregate gross proceeds to Credo from the offering, before deducting underwriting discounts and commissions","country":"USD","title":"GlobeNewswire - Credo announces closing of initial public offering"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/crown-crafts-nasdaq-crws-dividend-112142852.html","description":"The board of Crown Crafts, Inc. ( NASDAQ:CRWS ) has announced that it will pay a dividend on the 8th of April, with...","country":"USD","title":"Simply Wall St. - Crown Crafts' (NASDAQ:CRWS) Dividend Will Be US$0.08"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/rockwealth-resources-corp-closes-private-134500526.html","description":"Kelowna, British Columbia--(Newsfile Corp. - December 6, 2021) - Rockwealth Resources Corp. (TSXV: RWR) (the \"Company\") is pleased to report that it has closed the non-brokered Private Placement (the \"Private Placement\") previously announced (October 13, 2020) of 6,893,332 Units (each, a \"Unit\") at a price of $0.15 per Unit for aggregate gross proceeds of up to $1,034,000 (the \"Offering\"). Each Unit will be comprised of one common share and one common share ...","country":"USD","title":" - Rockwealth Resources Corp. Closes Private Placement and Announces Name Change"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/1-credit-suisse-entities-agree-212343186.html","description":"Credit Suisse Group AG entities, among six defendants in a lawsuit originally filed by Iowa Public Employees Retirement System and other retirement associations, has agreed to pay $81 million, the first to agree to settle, the law firm Cohen Milstein Sellers & Toll PLLC said in a release.  \"This first settlement agreement includes both an $81 million cash payment and an obligation on the part of Credit Suisse to provide cooperation to plaintiffs in litigating and ultimately trying their case against the remaining defendants,\" lawyers for the plaintiffs said in a court filing late on Friday.  The plaintiffs had accused units of Credit Suisse, Goldman Sachs Group Inc, JPMorgan Chase & Co and three other banks of conspiring since 2009 to keep the stock lending market \"in the stone age\" by boycotting startup platforms like AQS or Data Explorers.","country":"USD","title":" - UPDATE 1-Credit Suisse entities agree to settle lawsuit in U.S. for $81 million - court filing"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/splunk-jumps-report-cisco-made-020625904.html","description":"(Bloomberg) -- Splunk Inc. jumped as much as 16% in late trading on a report that Cisco Systems Inc. made an offer of more than $20 billion for the software company.Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Show Millennial Workers Favored Over ‘Dinobabies’Biden’s White House Makes a Telling MistakeThe shares climbed as high as $133","country":"USD","title":"Bloomberg - Splunk Jumps on Report That Cisco Made $20 Billion-Plus Offer"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/csp-nasdaq-cspi-debt-no-120432475.html","description":"Legendary fund manager Li Lu (who Charlie Munger backed) once said, 'The biggest investment risk is not the volatility...","country":"USD","title":"Simply Wall St. - CSP (NASDAQ:CSPI) Has Debt But No Earnings; Should You Worry?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/chartwell-fourth-quarter-2021-results-221500548.html","description":"Chartwell Retirement Residences (\"Chartwell\") (TSX: CSH.UN) announced today a change in time of its fourth quarter 2021 results conference call to 9:00 AM ET on February 25, 2022.","country":"USD","title":"CNW Group - Chartwell Fourth Quarter 2021 Results Conference Call Time Change"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/99c8c3bd-d122-31a1-b52d-a80a3beb46b1/dominion-energy%2C-inc-(d)-q4.html","description":"Image source: The Motley Fool.  Dominion Energy, Inc (NYSE: D)Q4 2021 Earnings CallFeb 11, 2022, 10:00 a.m. ETContents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  OperatorWelcome to the Dominion Energy fourth quarter and full year 2021 earnings conference call.","country":"USD","title":"Motley Fool - Dominion Energy, Inc (D) Q4 2021 Earnings Call Transcript"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/delivery-hero-slump-takes-down-123541366.html","description":"(Bloomberg) -- Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Show Millennial Workers Favored Over ‘Dinobabies’Biden’s White House Makes a Telling MistakeDelivery Hero SE’s share price crash this week was among the biggest one-day wipe outs recorded on Germany’s benchmark DAX index in recent years.Shares in the Berlin-based food-deliver","country":"USD","title":"Bloomberg - Delivery Hero’s Slump Takes Down Another Pandemic Favorite"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/bengals-good-cause-supported-quest-233014635.html","description":"Quest Diagnostics employees at the Cincinnati lab were thrilled about their local team, the Cincinnati Bengals, playing in this year’s Super Bowl against the Los Angeles Rams and came together to c...","country":"USD","title":"News Direct - Bengals and a Good Cause Are Supported by Quest Colleagues in Cincinnati"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/648bedf8-ce9e-3009-ab8c-4b4bc9aa2b41/dollar-tree-faces-backlash.html","description":"While many retailers struggled immensely during the pandemic, one breed of retailer shined: dollar stores.  At a time when consumers had to be cash-savvy, dollar stores came to the rescue, allowing customers to load up on household essentials on the relative cheap.  One such chain is Dollar Tree (NASDAQ: DLTR).","country":"USD","title":"Motley Fool - Dollar Tree Faces Backlash From Price Hikes: Will That Hurt Real Estate Investors?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/311c9191-e574-332c-ae8b-4163c403fe4c/1-growth-stock's-dominant.html","description":"Doximity (NYSE: DOCS) is one of the leading digital platforms for U.S. medical professionals and students.  With over 80% of all medical professionals in the U.S. using Doximity, the company clearly has been doing this quite well.  Doximity just reported third-quarter results for its 2022 fiscal year, and the company blew away expectations.","country":"USD","title":"Motley Fool - 1 Growth Stock's Dominant Grip Just Got Stronger"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/worth-considering-duke-energy-corporation-112721741.html","description":"Readers hoping to buy Duke Energy Corporation ( NYSE:DUK ) for its dividend will need to make their move shortly, as...","country":"USD","title":"Simply Wall St. - Is It Worth Considering Duke Energy Corporation (NYSE:DUK) For Its Upcoming Dividend?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/dzs-inc-nasdaq-dzsi-investors-120937489.html","description":"Today we'll do a simple run through of a valuation method used to estimate the attractiveness of DZS Inc. ( NASDAQ:DZSI...","country":"USD","title":"Simply Wall St. - Are DZS Inc. (NASDAQ:DZSI) Investors Paying Above The Intrinsic Value?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/79c9e59b-9c0e-3318-9cb7-d8f7bde9968d/4-reasons-electronic-arts-is.html","description":"Big news came out of California on Feb. 1 when video game publisher Electronic Arts (NASDAQ: EA) reported its third-quarter results for the three months ended in December.  Electronic Arts is firing on all cylinders right now.  This bifurcation between the stock price and business fundamentals provides a great opportunity for investors to pick up some shares of this high-quality stock.","country":"USD","title":"Motley Fool - 4 Reasons Electronic Arts Is a No-Brainer Buy Right Now"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/eastern-bankshares-nasdaq-ebc-upcoming-113301433.html","description":"Eastern Bankshares, Inc. ( NASDAQ:EBC ) will increase its dividend on the 15th of March to US$0.10. Although the...","country":"USD","title":"Simply Wall St. - Eastern Bankshares' (NASDAQ:EBC) Upcoming Dividend Will Be Larger Than Last Year's"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/golden-ocean-gogl-report-q4-203308167.html","description":"The favorable environment surrounding the Drybulk market is likely to have boosted Golden Ocean's (GOGL) top line in Q4.","country":"USD","title":"Zacks - Golden Ocean (GOGL) to Report Q4 Earnings: What's in Store?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/4a30280f-62f4-3de3-8dec-8f5128ba17fc/why-callaway-golf-stock.html","description":"Shares of golf-products maker Callaway Golf (NYSE: ELY) tumbled 9% through 3:30 p.m. Friday after reporting a loss -- but a smaller-than-expected loss -- for its fiscal fourth quarter 2021 last night.  Heading into the quarter, analysts had forecast that Callaway would lose $0.28 per share on sales of $703 million in Q4 2021.  Instead, Callaway says it lost only $0.19 per share, and its sales were $712 million -- so \"beats\" on both the top and bottom lines.","country":"USD","title":"Motley Fool - Why Callaway Golf Stock Crashed 9% Friday"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/56af14a6-8f8c-3e0e-8a94-a57a89b5a0b6/is-enphase-energy-stock-a-buy%3F.html","description":"Enphase Energy's fourth-quarter results, reported on Feb. 8, showed that revenue for the quarter grew 56% year over year to $413 million.  The company's GAAP gross margin for the quarter was 39.6%.  On a GAAP basis, the operating margin was nearly 14%, which improved from 10.6% in the previous quarter.","country":"USD","title":"Motley Fool - Is Enphase Energy Stock a Buy?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/extra-space-storage-exr-stock-231511962.html","description":"Extra Space Storage (EXR) closed the most recent trading day at $196.92, moving -0.98% from the previous trading session.","country":"USD","title":"Zacks - Extra Space Storage (EXR) Stock Moves -0.98%: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/bf4ca7b8-bc56-3c0f-92ac-bda7ec64b6a8/will-ford-be-a.html","description":"The company is making great progress with its EV strategy. But will that be enough to make the stock a monster winner for shareholders?","country":"USD","title":"Motley Fool - Will Ford Be a Trillion-Dollar Stock by 2030?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/fairfax-india-completes-investment-jaynix-220200191.html","description":"NOT FOR DISTRIBUTION TO U.S. NEWSWIRE SERVICES OR FOR DISSEMINATION IN THE UNITED STATES (Note: All dollar amounts in this news release are expressed in U.S. dollars, except as otherwise noted). TORONTO, Feb. 11, 2022 (GLOBE NEWSWIRE) -- Fairfax India Holdings Corporation (“Fairfax India” or the “Company”) (TSX: FIH.U) announces that, through its wholly-owned subsidiary, it has completed its investment of INR 2.45 billion (approximately $33 million at current exchange rates) for a 70% equity int","country":"USD","title":"GlobeNewswire - Fairfax India Completes Investment in Jaynix Engineering Private Limited"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/just-four-days-till-first-113611997.html","description":"First Hawaiian, Inc. ( NASDAQ:FHB ) is about to trade ex-dividend in the next four days. The ex-dividend date is one...","country":"USD","title":"Simply Wall St. - Just Four Days Till First Hawaiian, Inc. (NASDAQ:FHB) Will Be Trading Ex-Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/64818958-0f28-3f05-9a2e-3c4dae0a8ec1/flowers-foods-(flo)-q4-2021.html","description":"Image source: The Motley Fool.  Flowers Foods (NYSE: FLO)Q4 2021 Earnings CallFeb 11, 2022, 8:30 a.m. ETContents:  Prepared Remarks Questions and Answers Call Participants  Prepared Remarks:  OperatorGood day, and thank you for standing by.","country":"USD","title":"Motley Fool - Flowers Foods (FLO) Q4 2021 Earnings Call Transcript"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/ownership-structure-fonar-corporation-nasdaq-122851045.html","description":"The big shareholder groups in FONAR Corporation ( NASDAQ:FONR ) have power over the company. Institutions will often...","country":"USD","title":"Simply Wall St. - What Is The Ownership Structure Like For FONAR Corporation (NASDAQ:FONR)?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/fox-nasdaq-foxa-announced-dividend-113920579.html","description":"The board of Fox Corporation ( NASDAQ:FOXA ) has announced that it will pay a dividend of US$0.24 per share on the 30th...","country":"USD","title":"Simply Wall St. - Fox (NASDAQ:FOXA) Has Announced A Dividend Of US$0.24"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/a7dcd3ac-978f-3576-bb98-da496c619e2d/why-freshworks-stock.html","description":"Shares of Freshworks (NASDAQ: FRSH) got crushed Friday.  The software-as-a-service stock ended the daily trading session down 18% due to turbulence for the broader market and weaker-than-expected guidance that arrived with the company's fourth-quarter results.  Freshworks published its fourth-quarter results after the market closed on Thursday, reporting a non-GAAP (adjusted) loss per share of $0.06 on revenue of $105.5 million.","country":"USD","title":"Motley Fool - Why Freshworks Stock Plummeted Today"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/gatx-nyse-gatx-paying-larger-114226426.html","description":"GATX Corporation's ( NYSE:GATX ) dividend will be increasing to US$0.52 on 31st of March. This makes the dividend yield...","country":"USD","title":"Simply Wall St. - GATX (NYSE:GATX) Is Paying Out A Larger Dividend Than Last Year"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/green-dot-announce-fourth-quarter-000000373.html","description":"AUSTIN, Texas, February 12, 2022--Green Dot Corporation (NYSE: GDOT) will host a conference call and earnings webcast to discuss fourth quarter 2021 financial results on Thursday, February 24, 2022 at 5:00pm ET. A press release with fourth quarter 2021 financial results will be issued after the market closes that same day. The live webcast of the call can be accessed from Green Dot’s investor relations website at http://ir.greendot.com/. A replay will be available at the same website following t","country":"USD","title":"Business Wire - Green Dot to Announce Fourth Quarter 2021 Results on February 24th"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/d0c4226f-e1e4-30d3-b6da-fcbe8525d553/is-the-fda's-partial-hold-bad.html","description":"With Gilead Sciences' (NASDAQ: GILD) drug magrolimab now under a partial clinical hold with the U.S. Food and Drug Administration, how big of a setback could it be for the company?  In this segment from \"This Week in Healthcare,\" recorded on Jan. 31, Motley Fool contributors Brian Orelli and Keith Speights discuss what's at stake for investors as more news comes in on magrolimab.  Brian Orelli: The FDA put Gilead Sciences' magrolimab on partial clinical hold.","country":"USD","title":" - Is the FDA's Partial Hold Bad News for Gilead Investors?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/great-panther-files-ni-43-222600898.html","description":"Great Panther Mining Limited (TSX: GPR) (NYSE: GPL) (\"Great Panther\" or the \"Company\"), a growth-oriented precious metals producer focused on the Americas, reports the filing of the \"NI 43-101 Technical Report on the Topia Mine Mineral Resource Estimates as of March 31, 2021\" (the \"Technical Report\"). The Technical Report has an effective date of March 31, 2021.","country":"USD","title":"CNW Group - Great Panther Files NI 43-101 Technical Report for the Topia Mine"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/3-checks-buying-hci-group-114534693.html","description":"HCI Group, Inc. ( NYSE:HCI ) is about to trade ex-dividend in the next four days. The ex-dividend date is one business...","country":"USD","title":"Simply Wall St. - Do These 3 Checks Before Buying HCI Group, Inc. (NYSE:HCI) For Its Upcoming Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/healthcare-services-group-nasdaq-hcsg-114843514.html","description":"Healthcare Services Group, Inc. ( NASDAQ:HCSG ) will increase its dividend on the 25th of March to US$0.21. This takes...","country":"USD","title":"Simply Wall St. - Healthcare Services Group (NASDAQ:HCSG) Will Pay A Larger Dividend Than Last Year At US$0.21"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/estimating-fair-value-home-depot-125758767.html","description":"In this article we are going to estimate the intrinsic value of The Home Depot, Inc. ( NYSE:HD ) by projecting its...","country":"USD","title":"Simply Wall St. - Estimating The Fair Value Of The Home Depot, Inc. (NYSE:HD)"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/institutions-own-hamilton-lane-alliance-130253077.html","description":"The big shareholder groups in Hamilton Lane Alliance Holdings I, Inc. ( NASDAQ:HLAH ) have power over the company...","country":"USD","title":"Simply Wall St. - Do Institutions Own Hamilton Lane Alliance Holdings I, Inc. (NASDAQ:HLAH) Shares?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/many-hni-corporation-nyse-hni-131234318.html","description":"Every investor in HNI Corporation ( NYSE:HNI ) should be aware of the most powerful shareholder groups. Institutions...","country":"USD","title":"Simply Wall St. - How Many HNI Corporation (NYSE:HNI) Shares Do Institutions Own?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/8469d2b5-6049-332f-9adf-c16fd2c30be5/why-harley-davidson-shares.html","description":"Shares of Harley-Davidson (NYSE: HOG) roared to life this week after the motorcycle maker reported a surprise fourth-quarter profit that saw motorcycle revenue surge 54% as U.S. demand for big bikes returned.  Harley's stock jumped 16.7% on the results, according to data by S&P Global Market Intelligence, accelerating a turnaround for the shares that began last month.  Demand for big bore motorcycles like the ones Harley-Davidson makes has been on a years-long slide, which is still apparent in its results.","country":"USD","title":"Motley Fool - Why Harley-Davidson Shares Were Revved Up This Week"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/healthstream-inc-nasdaq-hstm-fundamentals-131732854.html","description":"HealthStream (NASDAQ:HSTM) has had a rough three months with its share price down 12%. However, stock prices are...","country":"USD","title":"Simply Wall St. - HealthStream, Inc.'s (NASDAQ:HSTM) Fundamentals Look Pretty Strong: Could The Market Be Wrong About The Stock?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/hawkins-nasdaq-hwkn-could-buy-115151204.html","description":"Readers hoping to buy Hawkins, Inc. ( NASDAQ:HWKN ) for its dividend will need to make their move shortly, as the stock...","country":"USD","title":"Simply Wall St. - Hawkins (NASDAQ:HWKN) Could Be A Buy For Its Upcoming Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/ibm-emails-show-millennial-workers-030455323.html","description":"(Bloomberg) -- IBM executives discussed in emails how to force out older workers and derided them as “Dinobabies” who should be made an “Extinct species,” according to a court filing in an age discrimination case against the company.Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Show Millennial Workers Favored Over ‘Dinobabies’Biden’s W","country":"USD","title":"Bloomberg - IBM Emails Show Millennial Workers Favored Over ‘Dinobabies’"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/analysts-optimistic-well-see-profit-132219391.html","description":"With the business potentially at an important milestone, we thought we'd take a closer look at Infrastructure and...","country":"USD","title":"Simply Wall St. - Analysts Are Optimistic We'll See A Profit From Infrastructure and Energy Alternatives, Inc. (NASDAQ:IEA)"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/smart-buy-imperial-brands-plc-063428625.html","description":"It looks like Imperial Brands PLC ( LON:IMB ) is about to go ex-dividend in the next four days. The ex-dividend date is...","country":"USD","title":"Simply Wall St. - Is It Smart To Buy Imperial Brands PLC (LON:IMB) Before It Goes Ex-Dividend?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/integrated-biopharma-reports-results-quarter-193000008.html","description":"HILLSIDE, NJ / ACCESSWIRE / February 10, 2022 / Integrated BioPharma, Inc. (OTCQX:INBP) (the \"Company\" or \"INBP\") reports its financial results for the quarter ended December 31, 2021.","country":"USD","title":" - Integrated BioPharma Reports Results for its Quarter Ended December 31, 2021"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/investors-summit-hotel-properties-nyse-132712706.html","description":"In order to justify the effort of selecting individual stocks, it's worth striving to beat the returns from a market...","country":"USD","title":"Simply Wall St. - Investors in Summit Hotel Properties (NYSE:INN) have unfortunately lost 27% over the last five years"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/only-four-days-left-cash-115808371.html","description":"Some investors rely on dividends for growing their wealth, and if you're one of those dividend sleuths, you might be...","country":"USD","title":"Simply Wall St. - Only Four Days Left To Cash In On International Paper's (NYSE:IP) Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/us-36-38-thats-analysts-115500401.html","description":"Intapp, Inc. ( NASDAQ:INTA ) defied analyst predictions to release its second-quarter results, which were ahead of...","country":"USD","title":"Simply Wall St. - US$36.38: That's What Analysts Think Intapp, Inc. (NASDAQ:INTA) Is Worth After Its Latest Results"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/itt-inc-just-beat-analyst-120117753.html","description":"Last week, you might have seen that ITT Inc. ( NYSE:ITT ) released its yearly result to the market. The early response...","country":"USD","title":"Simply Wall St. - ITT Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Predictions"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/e625d8e6-66ec-3ecc-8b75-7da3a72d0dbf/3-high-yield-dividend-stocks.html","description":"One solid strategy for boosting your portfolio's long-term value is by investing in dividend stocks.  Three stocks that are excellent sources of recurring income are Novartis (NYSE: NVS), BCE (NYSE: BCE), and Kraft Heinz (NASDAQ: KHC).  Collectively, they can help diversify your portfolio, and at their current share prices, all yield more than double the S&P 500's average yield of 1.3%.","country":"USD","title":"Motley Fool - 3 High-Yield Dividend Stocks to Buy and Hold for Decades"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/kopins-nasdaq-kopn-investors-pleased-134149128.html","description":"Some Kopin Corporation ( NASDAQ:KOPN ) shareholders are probably rather concerned to see the share price fall 58% over...","country":"USD","title":"Simply Wall St. - Kopin's (NASDAQ:KOPN) investors will be pleased with their respectable 93% return over the last three years"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/lemonade-lmnd-stock-moves-1-230011733.html","description":"Lemonade (LMND) closed at $29 in the latest trading session, marking a -1.56% move from the prior day.","country":"USD","title":"Zacks - Lemonade (LMND) Stock Moves -1.56%: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/lamprell-plcs-lon-lam-intrinsic-072649270.html","description":"In this article we are going to estimate the intrinsic value of Lamprell plc ( LON:LAM ) by projecting its future cash...","country":"USD","title":"Simply Wall St. - Lamprell plc's (LON:LAM) Intrinsic Value Is Potentially 99% Above Its Share Price"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/wrapup-1-us-says-russia-105959391.html","description":"The United States and its allies urged their citizens to leave Ukraine right away to avoid a Russian invasion, including a possible air assault, that Washington said on Friday could occur anytime.  Moscow accused Western nations of spreading lies to distract from their own aggressive acts.  The United States and Europe stepped up their warnings of an imminent attack while the Kremlin, jostling for more influence in post-Cold War Europe, rejected a joint EU-NATO diplomatic response to its demands to reduce tensions as disrespectful.","country":"USD","title":" - WRAPUP 14-U.S. and allies tell citizens to leave Ukraine as Russia could invade 'at any time'"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/malibu-boats-inc-nasdaq-mbuu-134635305.html","description":"Malibu Boats' (NASDAQ:MBUU) stock is up by a considerable 7.8% over the past week. Given that the market rewards strong...","country":"USD","title":"Simply Wall St. - Is Malibu Boats, Inc.'s (NASDAQ:MBUU) Latest Stock Performance A Reflection Of Its Financial Health?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/consensus-eps-estimates-mayville-engineering-120424479.html","description":"Market forces rained on the parade of Mayville Engineering Company, Inc. ( NYSE:MEC ) shareholders today, when the...","country":"USD","title":"Simply Wall St. - The Consensus EPS Estimates For Mayville Engineering Company, Inc. (NYSE:MEC) Just Fell Dramatically"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/analyst-forecasts-just-became-more-120756328.html","description":"Today is shaping up negative for MEI Pharma, Inc. ( NASDAQ:MEIP ) shareholders, with the analysts delivering a...","country":"USD","title":"Simply Wall St. - Analyst Forecasts Just Became More Bearish On MEI Pharma, Inc. (NASDAQ:MEIP)"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/3ms-nyse-mmm-upcoming-dividend-121127700.html","description":"3M Company's ( NYSE:MMM ) dividend will be increasing to US$1.49 on 12th of March. This takes the dividend yield to...","country":"USD","title":"Simply Wall St. - 3M's (NYSE:MMM) Upcoming Dividend Will Be Larger Than Last Year's"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/increases-model-n-inc-nyse-121500861.html","description":"Performance at Model N, Inc. ( NYSE:MODN ) has been reasonably good and CEO Jason Blessing has done a decent job of...","country":"USD","title":"Simply Wall St. - Increases to Model N, Inc.'s (NYSE:MODN) CEO Compensation Might Cool off for now"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/theres-lot-mscis-nyse-msci-121830744.html","description":"MSCI Inc. ( NYSE:MSCI ) is about to trade ex-dividend in the next four days. Typically, the ex-dividend date is one...","country":"USD","title":"Simply Wall St. - There's A Lot To Like About MSCI's (NYSE:MSCI) Upcoming US$1.04 Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/17b3ac87-8908-3441-b62f-023e0a87146f/here-are-some-profitable.html","description":"In this Fool Live video clip, recorded on Jan. 27, Fool.com contributors Matt Frankel, Travis Hoium, Rick Munarriz, and Jose Najarro discuss some of their favorite profitable growth stocks that are worth a look now.  Travis Hoium: Top-five growth companies that are profitable.  After the report, how can you not like Microsoft (NASDAQ: MSFT) right now?","country":"USD","title":" - Here Are Some Profitable Growth Stocks to Put on Your Radar"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/mgic-investment-corporation-nyse-mtg-122202612.html","description":"MGIC Investment Corporation ( NYSE:MTG ) is about to trade ex-dividend in the next 2 days. The ex-dividend date occurs...","country":"USD","title":"Simply Wall St. - MGIC Investment Corporation (NYSE:MTG) Looks Like A Good Stock, And It's Going Ex-Dividend Soon"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/mount-gibson-iron-limiteds-asx-000000244.html","description":"Mount Gibson Iron (ASX:MGX) has had a great run on the share market with its stock up by a significant 37% over the...","country":"USD","title":"Simply Wall St. - Mount Gibson Iron Limited's (ASX:MGX) Stock is Soaring But Financials Seem Inconsistent: Will The Uptrend Continue?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/micron-mu-stock-moves-1-224510196.html","description":"In the latest trading session, Micron (MU) closed at $89.76, marking a -1.38% move from the previous day.","country":"USD","title":"Zacks - Micron (MU) Stock Moves -1.38%: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/buy-nathans-famous-inc-nasdaq-122539402.html","description":"Some investors rely on dividends for growing their wealth, and if you're one of those dividend sleuths, you might be...","country":"USD","title":"Simply Wall St. - Should You Buy Nathan's Famous, Inc. (NASDAQ:NATH) For Its Upcoming Dividend?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/a0008603-033d-32b7-b311-eccdf976bc48/4-strong-renewable-energy.html","description":"In 2022, there are plenty of investment options for renewable energy growth stocks, but in this video clip from \"The High Energy Show\" on Motley Fool Live, recorded on Feb. 1, Fool contributors Travis Hoium, Jason Hall, and John Bromels list their top choices to consider for your portfolio.  Travis Hoium: Let's turn gears a little bit and go with best growth stock in the renewable sector.  Jason Hall: I'm going to go with Atlantica Yield (NASDAQ: AY), I think is really interesting.","country":"USD","title":" - 4 Strong Renewable Energy Growth Stocks"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/nikola-nkla-stock-moves-1-224510100.html","description":"Nikola (NKLA) closed the most recent trading day at $7.79, moving -1.77% from the previous trading session.","country":"USD","title":"Zacks - Nikola (NKLA) Stock Moves -1.77%: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/why-might-not-sense-buy-123235424.html","description":"It looks like Neenah, Inc. ( NYSE:NP ) is about to go ex-dividend in the next 4 days. The ex-dividend date occurs one...","country":"USD","title":"Simply Wall St. - Why It Might Not Make Sense To Buy Neenah, Inc. (NYSE:NP) For Its Upcoming Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/8459c994-9cb6-3983-97ec-e6a44c254745/why-novavax-stock-got-a-shot.html","description":"In contrast to the wider stock market, shares of vaccine specialist Novavax (NASDAQ: NVAX) were cruising higher on Friday.  The company's stock was up by 1.2% in midafternoon trading, against the nearly 2% decline of the S&P 500 index, on positive news about its coronavirus vaccine.  On Thursday after market hours, Novavax announced that its NVX-CoV2373 achieved its primary effectiveness endpoint in a phase 3 clinical trial involving adolescents.","country":"USD","title":"Motley Fool - Why Novavax Stock Got a Shot in the Arm Friday"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/93f56963-d2eb-3783-91cd-0d1e6f67c6fd/3-reasons-nvidia's-%2440.html","description":"On Feb. 7, Nvidia (NASDAQ: NVDA) formally announced the termination of its $40 billion bid for SoftBank's (OTC: SFTB.Y) Arm Holdings.  Nvidia agreed to buy Arm back in September 2020 to create the \"world's premier computing company for the age of AI.\"","country":"USD","title":"Motley Fool - 3 Reasons Nvidia's $40 Billion Bid for Arm Holdings Failed"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/corporate-office-properties-ofc-surpasses-225510809.html","description":"Corporate Office Properties (OFC) delivered FFO and revenue surprises of 1.75% and 8.64%, respectively, for the quarter ended December 2021. Do the numbers hold clues to what lies ahead for the stock?","country":"USD","title":"Zacks - Corporate Office Properties (OFC) Surpasses Q4 FFO and Revenue Estimates"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/sticking-gas-guzzlers-over-evs-150000265.html","description":"(Bloomberg) -- The U.S. Postal Service is expected in coming days to reaffirm its plan to pay Oshkosh Corp. as much as $6 billion over 10 years to replace an aging fleet of red-white-and blue delivery vans with mostly gasoline-powered models instead of climate-friendly electric vehicles. Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Emails Sh","country":"USD","title":"Bloomberg - Sticking With Gas-Guzzlers Over EVs Could Delay Postal Upgrade"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/why-might-interested-otis-worldwide-123607767.html","description":"Readers hoping to buy Otis Worldwide Corporation ( NYSE:OTIS ) for its dividend will need to make their move shortly...","country":"USD","title":"Simply Wall St. - Why You Might Be Interested In Otis Worldwide Corporation (NYSE:OTIS) For Its Upcoming Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/9ddaf7f6-59cd-3ca4-a2ed-dce87177c0ca/this-disruptive-company-has.html","description":"Paycom Software (NYSE: PAYC) has been at the forefront of disrupting the payroll sector since CEO Chad Richison founded the company in 1998.  The company's latest innovation, Beti, is once again disrupting the industry by changing the entire payroll procedure.  It's helping drive explosive growth for Paycom, which could continue for years to come.","country":"USD","title":"Motley Fool - This Disruptive Company Has Explosive Growth Potential"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/paychex-payx-stock-moves-1-225010781.html","description":"In the latest trading session, Paychex (PAYX) closed at $118.91, marking a -1.21% move from the previous day.","country":"USD","title":"Zacks - Paychex (PAYX) Stock Moves -1.21%: What You Should Know"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/randy-fields-talks-great-advancements-102000337.html","description":"Randall K. (Randy) Fields, Chairman and CEO of ReposiTrak, was interviewed by Adam Torres on Mission Matters Business Podcast. Randall K. (Randy) Fields was interviewed by Adam Torres on Mission Matters Business Podcast. Randall K. (Randy) Fields, Chairman and CEO of ReposiTrak, was interviewed by Adam Torres on Mission Matters Business Podcast. Beverly Hills , Feb. 12, 2022 (GLOBE NEWSWIRE) -- ReposiTrak is a Utah-based SaaS firm; in this interview, Chairman and CEO Randall Fields talks about i","country":"USD","title":"GlobeNewswire - Randy Fields Talks About Great Advancements in Food Traceability and How the Industry Can Comply"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/a6f4ae75-89ba-3c1d-8bb7-70774599b871/how-much-more-upside-does.html","description":"Consumer staples giant Procter & Gamble (NYSE: PG) is a proven blue-chip stock, selling millions of household and personal care products since the early 1800s.  The share price is up more than 20% over the past twelve months as investors spent much of 2021 flocking from high-growth to defensive investments.  Investors will want to consider these three reasons why Procter & Gamble could struggle over the rest of this year.","country":"USD","title":"Motley Fool - How Much More Upside Does This Dividend King Have?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/petroteq-announces-closing-equity-subscription-004500622.html","description":"SHERMAN OAKS, CA / ACCESSWIRE / February 12, 2022 / Petroteq Energy Inc. (\"Petroteq\" or the \"Company\") (TSXV:PQE)(OTC PINK:PQEFF)(FSE:PQCF), an oil ‎company focused on the development and implementation of its proprietary oil-‎extraction and remediation technologies, announces the closing of the US$750,000 subscription for 6,250,000 units of Petroteq at a price of US$0.","country":"USD","title":" - Petroteq Announces Closing of Equity Subscription"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/primerica-nyse-pri-pay-larger-124427409.html","description":"The board of Primerica, Inc. ( NYSE:PRI ) has announced that it will be increasing its dividend on the 14th of March to...","country":"USD","title":"Simply Wall St. - Primerica (NYSE:PRI) Will Pay A Larger Dividend Than Last Year At US$0.55"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/envirogold-global-seeks-double-potential-052300561.html","description":"TORONTO, Feb. 13, 2022 (GLOBE NEWSWIRE) -- EnviroGold Global Limited (CSE: NVRO | OTCQB: RGOZF |FSE: YGK) (“EnviroGold Global” or the “Company“), a Clean Technology Company accelerating the world’s transition to a circular-resource economy through the production of Metals Without Mining, is pleased to announce it will initiate a coring program targeting the recently discovered “Western Arc” polymetallic tailings extension identified by a January 2022 independent geophysical survey (link) that in","country":"USD","title":"GlobeNewswire - EnviroGold Global Seeks to Double Potential High-Grade Tailings Project Upside with Initiation of Coring Program Targeting Major Polymetallic Tailings Deposit Extension at Buchans Project in Newfoundland and Labrador, Canada"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/why-crypto-miners-could-big-143000408.html","description":"Here are three top crypto miners investors may want to watch as potential recovery plays for the latter half of 2022. The post Why Crypto Miners Could Be Big Winners for the Rest of 2022 appeared first on The Motley Fool Canada.","country":"USD","title":"The Motley Fool - Why Crypto Miners Could Be Big Winners for the Rest of 2022"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/ryu-apparel-doubles-down-ecommerce-110000057.html","description":"RYU Apparel Inc. (TSXV: RYU) (OTCQB: RYPPF) (FWB: RYAA) (\"RYU\" or the \"Company\"), creator of award-winning urban athletic apparel announces that it will shift focus to its digital ecommerce business and close two store locations.","country":"USD","title":"CNW Group - RYU Apparel Doubles Down on Ecommerce in 2022 Based on Strong Third and Fourth Quarter Digital Performance"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/sandy-spring-bancorp-inc-nasdaq-125244849.html","description":"Sandy Spring Bancorp, Inc. ( NASDAQ:SASR ) is about to trade ex-dividend in the next four days. Typically, the...","country":"USD","title":"Simply Wall St. - Sandy Spring Bancorp, Inc. (NASDAQ:SASR) Passed Our Checks, And It's About To Pay A US$0.34 Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/2920d007-f75b-3611-abc8-01e3958a6325/3-numbers-that-will-make-you.html","description":"Big news came out of Sweden on Feb. 2 when Spotify (NYSE: SPOT) released its fourth-quarter and full-year earnings report.  The global audio streamer put up solid growth numbers and is making great progress expanding beyond music streaming.  As of this writing, shares of Spotify are down a whopping 29% year to date (YTD).","country":"USD","title":"Motley Fool - 3 Numbers That Will Make You Ecstatic About Spotify's Growth Potential"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/shutterstock-nyse-sstk-increasing-dividend-125654964.html","description":"Shutterstock, Inc. ( NYSE:SSTK ) will increase its dividend on the 17th of March to US$0.24. Although the dividend is...","country":"USD","title":"Simply Wall St. - Shutterstock (NYSE:SSTK) Is Increasing Its Dividend To US$0.24"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/satish-malhotra-ceo-president-director-130104067.html","description":"Potential The Container Store Group, Inc. ( NYSE:TCS ) shareholders may wish to note that the CEO, President...","country":"USD","title":"Simply Wall St. - Satish Malhotra Is The CEO, President & Director of The Container Store Group, Inc. (NYSE:TCS) And They Just Picked Up 15% More Shares"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/theres-lot-tractor-supplys-nasdaq-130516320.html","description":"Readers hoping to buy Tractor Supply Company ( NASDAQ:TSCO ) for its dividend will need to make their move shortly, as...","country":"USD","title":"Simply Wall St. - There's A Lot To Like About Tractor Supply's (NASDAQ:TSCO) Upcoming US$0.92 Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/tyson-foods-announces-quarterly-dividend-211500971.html","description":"SPRINGDALE, Ark., Feb. 11, 2022 (GLOBE NEWSWIRE) -- The Board of Directors of Tyson Foods (NYSE: TSN), at a meeting on February 9, 2022, declared a quarterly dividend of $0.46 per share on Class A common stock and $0.414 per share on Class B common stock, payable on June 15, 2022, to shareholders of record at the close of business on June 1, 2022. About Tyson Foods Tyson Foods (NYSE: TSN) is one of the world’s largest food companies and a recognized leader in protein. Founded in 1935 by John W.","country":"USD","title":"GlobeNewswire - Tyson Foods Announces Quarterly Dividend"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/worried-volatility-3-top-defensive-161500582.html","description":"Investors worried about rate hikes and inflation should look to defensive dividend stocks like Emera Inc. (TSX:EMA) in February 2022. The post Worried About Volatility? 3 Top Defensive Dividend Stocks to Buy Today appeared first on The Motley Fool Canada.","country":"USD","title":"The Motley Fool - Worried About Volatility? 3 Top Defensive Dividend Stocks to Buy Today"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/7f08106c-b1ef-3461-89aa-048a0e7975aa/where-will-unity-software-be.html","description":"Unity Software (NYSE: U) is one of the most popular metaverse stocks in which to invest.  With its 3D-animation tools, the company is a logical choice for content creators.  Additionally, Unity's augmented-reality (AR) and virtual-reality (VR) solutions give the company exposure to multiple other industries.","country":"USD","title":"Motley Fool - Where Will Unity Software Be in 5 Years?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/uber-technologies-inc-nyse-uber-131020392.html","description":"Uber Technologies, Inc. ( NYSE:UBER ) defied analyst predictions to release its yearly results, which were ahead of...","country":"USD","title":"Simply Wall St. - Uber Technologies, Inc. (NYSE:UBER) Just Reported, And Analysts Assigned A US$63.20 Price Target"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/udemy-inc-nasdaq-udmy-just-131524947.html","description":"It's been a sad week for Udemy, Inc. ( NASDAQ:UDMY ), who've watched their investment drop 12% to US$13.18 in the week...","country":"USD","title":"Simply Wall St. - Udemy, Inc. (NASDAQ:UDMY) Just Reported Earnings, And Analysts Cut Their Target Price"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/7ac15277-fa3e-368a-b519-b2d15305f4bb/here's-how-healthcare-stocks.html","description":"Healthcare stocks fared even worse, with the Health Care Select Sector SPDR Fund (NYSEMKT: XLV) declining by 6.9% in the first month of the year.  In this first chart analyzing historical annual returns, I compare how the Health Care Select SPDR Fund has performed along with the top healthcare stock on the market -- UnitedHealth Group (NYSE: UNH).  While the exchange-traded fund (ETF) has averaged a loss of more than 2% during years when it was off to a slow start, UnitedHealth's stock has managed to turn things around, and it has even averaged double-digit gains when it stumbled out of the gate.","country":"USD","title":"Motley Fool - Here's How Healthcare Stocks Have Historically Performed After a Down January"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/d0c6b9e1-bf22-3298-bf78-4cf63a1b4f24/down-70%25-in-3-months%2C-is.html","description":"Upstart Holdings (NASDAQ: UPST) is growing rapidly, but that hasn't stopped its stock from tumbling in the recent market correction.  Lou Whiteman: You can see the charts now.  Now, Upstart, like I said, I think most Fools get the business, but let's go over it because I think to talk about what they do lays out the bull case.","country":"USD","title":" - Down 70% in 3 Months, Is Upstart a Buy?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/utah-medical-products-nasdaq-utmd-132529843.html","description":"Utah Medical Products, Inc. ( NASDAQ:UTMD ) has announced that it will pay a dividend of US$0.29 per share on the 5th...","country":"USD","title":"Simply Wall St. - Utah Medical Products (NASDAQ:UTMD) Is Due To Pay A Dividend Of US$0.29"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/news-flash-4-analysts-think-133035960.html","description":"Today is shaping up negative for Veru Inc. ( NASDAQ:VERU ) shareholders, with the analysts delivering a substantial...","country":"USD","title":"Simply Wall St. - News Flash: 4 Analysts Think Veru Inc. (NASDAQ:VERU) Earnings Are Under Threat"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/986377c1-71fc-34ca-86eb-5cba1f832ae3/which-is-a-better-buy-rh.html","description":"RH (NYSE: RH) and Wayfair (NYSE: W) are two key players in the home furnishing industry and both are down over 40% from their 52-week highs.  Both stocks are dealing with a mix of supply chain concerns; fears that home spending, which surged during the height of the pandemic, is cooling down; and the general sell-off of growth stocks over the past few months.  RH looks far more palatable given this wide gulf in valuations, but let's play devil's advocate and assume Wayfair trades at a premium valuation because it is a newer, high-growth e-commerce company.","country":"USD","title":"Motley Fool - Which Is a Better Buy -- RH or Wayfair?"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/m/8865c1be-a143-3447-b8da-692b6eec324f/1-key-metric-shows-how-wells.html","description":"Wells Fargo has struggled to keep its efficiency ratio down in recent years and looks to be finally turning the corner.","country":"USD","title":"Motley Fool - 1 Key Metric Shows How Wells Fargo Can Recover"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/wonderfi-announces-2022-q1-financial-020200329.html","description":"Cash Reserves and Crypto Holdings Total $79.6 Million Post-February Financing Vancouver, British Columbia--(Newsfile Corp. - February 11, 2022) - WonderFi Technologies Inc. (NEO: WNDR) (OTC Pink: WONDF) (WKN: A3C166) (FTX: WNDR) (the \"Company\" or \"WonderFi\") today announced its quarterly financial results for the period ended December 31, 2021.Financial Highlights (in CAD):Total assets as of December 31, 2021 were $46.9 million, including $28.8 million in cash and $11.3 million in crypto assetsN","country":"USD","title":"Newsfile - WonderFi Announces 2022 Q1 Financial Results"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/yum-china-holdings-nyse-yumc-134145810.html","description":"The board of Yum China Holdings, Inc. ( NYSE:YUMC ) has announced that it will pay a dividend of US$0.12 per share on...","country":"USD","title":"Simply Wall St. - Yum China Holdings (NYSE:YUMC) Has Re-Affirmed Its Dividend Of US$0.12"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/analysts-more-bearish-zimmer-biomet-135408628.html","description":"Today is shaping up negative for Zimmer Biomet Holdings, Inc. ( NYSE:ZBH ) shareholders, with the analysts delivering a...","country":"USD","title":"Simply Wall St. - Analysts Are More Bearish On Zimmer Biomet Holdings, Inc. (NYSE:ZBH) Than They Used To Be"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/legion-said-prepare-board-fight-225903480.html","description":"(Bloomberg) -- Activist investor Legion Partners Asset Management is preparing to nominate a slate of three directors to the board of SurveyMonkey parent Momentive Global Inc. as opposition mounts to its takeover by software company Zendesk Inc., according to people familiar with the matter. Most Read from BloombergBiden-Putin Call Is Inconclusive as Ukraine Tensions JumpU.K. Hospital Patient Dies From Confirmed Case of Lassa FeverBiden Warns Putin of Risk of Heavy Price: Ukraine UpdateIBM Email","country":"USD","title":" - Legion Is Said to Prepare Board Fight at SurveyMonkey Parent"},{"source":"fin_news_nlp/yahoo_usd_tickers_news","url":"https://ca.finance.yahoo.com/news/china-belt-road-impact-global-200000933.html","description":"China’s massive Belt and Road initiative is poised to have a significant impact on the global critical metals trade","country":"USD","title":" - How Will China’s Belt And Road Impact Global Critical Metal Supplies?"}]